In [3]:
import pandas as pd

In [3]:
pets = {
    'species': ['cat', 'dog', 'parrot', 'cockroach'], 
    'name': ['Dr. Mittens Lamar', 'Diesel', 'Peach', 'Richard'], 
    'legs': [4, 4, 2, 6],
    'wings': [0, 0, 2, 4],
    'looking_for_home': ['no', 'no', 'no', 'yes']
}
df = pd.DataFrame(pets)
df.head()

     species               name  legs  wings looking_for_home
0        cat  Dr. Mittens Lamar     4      0               no
1        dog             Diesel     4      0               no
2     parrot              Peach     2      2               no
3  cockroach            Richard     6      4              yes

You can see the row index in the first column on the left. Column names **(labels)** are in the header. Another way to describe indexing is **axis labeling**. You can see two axes in our data frame, vertical (rows) — `axis 0` and horizontal (columns) — `axis 1`. Let's take a look at the axes of our DataFrame by accessing the df.axes attribute.

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column                                                   Non-Null Count  Dtype
---  ------                                                   --------------  -----
 0   zero_deg sixty_deg ninety_deg straight_angle name label  5 non-null      object
dtypes: object(1)
memory usage: 172.0+ bytes

In [16]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
df.columns

Index(['species', 'name', 'legs', 'wings', 'looking_for_home'], dtype='object')

### Exercises

In [21]:
from io import StringIO
data = """zero_deg sixty_deg ninety_deg straight_angle name label
0 0.437427 0.127416 0.258251 0.425674 EAO2 Mine
1 0.421407 0.439730 0.560459 0.424267 PD38 Mine
2 0.205278 0.434688 0.398431 0.532222 JL46 Rock
3 0.094910 0.132226 0.105227 0.156142 M7V9 Rock
4 0.314031 0.272306 0.057900 0.486960 PIYW Rock
"""

In [23]:
# Use StringIO to simulate a file-like object
data_io = StringIO(data)
# Load the data into a pandas DataFrame
df = pd.read_csv(data_io, sep='\t')
# Display the DataFrame
print(df)

  zero_deg sixty_deg ninety_deg straight_angle name label
0    0 0.437427 0.127416 0.258251 0.425674 EAO2 Mine
1    1 0.421407 0.439730 0.560459 0.424267 PD38 Mine
2    2 0.205278 0.434688 0.398431 0.532222 JL46 Rock
3    3 0.094910 0.132226 0.105227 0.156142 M7V9 Rock
4    4 0.314031 0.272306 0.057900 0.486960 PIYW Rock

In [18]:
df_rock.head()

   zero_deg  sixty_deg  ninety_deg  straight_angle label
0  0.437427   0.127416    0.258251        0.425674  Mine
1  0.421407   0.439730    0.560459        0.424267  Mine
2  0.205278   0.434688    0.398431        0.532222  Rock
3  0.094910   0.132226    0.105227        0.156142  Rock
4  0.314031   0.272306    0.057900        0.486960  Rock

In [17]:
df_rock.reset_index(inplace=True, drop=True)

In [25]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['zero_deg sixty_deg ninety_deg straight_angle name label'], dtype='object')]

In [14]:
df_rock.set_index('name', inplace=True)

In [5]:
data = {
    "0°": [0.437427, 0.421407, 0.205278, 0.094910, 0.314031],
    "60°": [0.127416, 0.439730, 0.434688, 0.132226, 0.272306],
    "90°": [0.258251, 0.560459, 0.398431, 0.105227, 0.057900],
    "180°": [0.425674, 0.424267, 0.532222, 0.156142, 0.486960],
    "name": ["EAO2", "PD38", "JL46", "M7V9", "PIYW"],
    "label": ["Mine", "Mine", "Rock", "Rock", "Rock"]
}

In [6]:
df_rock = pd.DataFrame(data)

In [12]:
df_rock.head()

   zero_deg  sixty_deg  ninety_deg  straight_angle  name label
0  0.437427   0.127416    0.258251        0.425674  EAO2  Mine
1  0.421407   0.439730    0.560459        0.424267  PD38  Mine
2  0.205278   0.434688    0.398431        0.532222  JL46  Rock
3  0.094910   0.132226    0.105227        0.156142  M7V9  Rock
4  0.314031   0.272306    0.057900        0.486960  PIYW  Rock

In [11]:
df_rock.rename(columns={'0°':'zero_deg', '60°': 'sixty_deg', '90°':'ninety_deg', '180°':'straight_angle'}, inplace=True)

In [ ]:
            0°	        60°	        90°	        180°	    name	label
0	0.437427	0.127416	0.258251	0.425674	EAO2	Mine
1	0.421407	0.439730	0.560459	0.424267	PD38	Mine
2	0.205278	0.434688	0.398431	0.532222	JL46	Rock
3	0.094910	0.132226	0.105227	0.156142	M7V9	Rock
4	0.314031	0.272306	0.057900	0.486960	PIYW	Rock

### Air force hierarch example

In [25]:
afcs = pd.DataFrame({'code': [1, 3, 5, 7, 9],
                     'skill_level': ['helper', 'apprentice', 'journeyman', 'craftsman', 'superintendent']})
afcs.head()

   code     skill_level
0     1          helper
1     3      apprentice
2     5      journeyman
3     7       craftsman
4     9  superintendent

In [26]:
afcs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   code         5 non-null      int64
 1   skill_level  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [20]:
afcs.set_index('code', inplace=True)
afcs.head()

         skill_level
code
1             helper
3         apprentice
5         journeyman
7          craftsman
9     superintendent

In [23]:
afcs.index

Index([1, 3, 5, 7, 9], dtype='int64', name='code')

### example 3

In [37]:
data_1= {
    '': ['first', 'peng #2', 'third', '4', 'another one', '5'],
    'species': ['Adelie', 'Adelie', 'Chinstrap', 'Chinstrap', 'Gentoo', 'Gentoo'],
    'bill_length_mm': [41.1, 39.6, 50.0, 54.2, 41.7, 45.5],
    'bill_depth_mm': [18.2, 17.7, 19.5, 20.8, 14.7, 13.9]
}

In [38]:
penguins_example = pd.DataFrame(data_1)

In [39]:
penguins_example.head()

                  species  bill_length_mm  bill_depth_mm
0        first     Adelie            41.1           18.2
1      peng #2     Adelie            39.6           17.7
2        third  Chinstrap            50.0           19.5
3            4  Chinstrap            54.2           20.8
4  another one     Gentoo            41.7           14.7

In [41]:
penguins_example.set_index('', inplace=True)

## bring code to the example shown

In [47]:
penguins_example.head()

     species  bill_length_mm  bill_depth_mm
0     Adelie            41.1           18.2
1     Adelie            39.6           17.7
2  Chinstrap            50.0           19.5
3  Chinstrap            54.2           20.8
4     Gentoo            41.7           14.7

In [45]:
penguins_example.reset_index(inplace=True, drop=True)